randread/128_node/job_1470988_fiojob_32/nid00100_fiojob_32/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 32 processes
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
[...]

test: (groupid=0, jobs=32): err= 0: pid=222421: Mon Jul 19 22:26:18 2021
  read: IOPS=593, BW=2372KiB/s (2429kB/s)(695MiB/300043msec)
    slat (usec): min=690, max=295879, avg=53919.49, stdev=16338.45
    clat (usec): min=14, max=17049k, avg=13442896.91, stdev=2124015.94
     lat (msec): min=2, max=17109, avg=13496.82, stdev=2127.06
    clat percentiles (msec):
     |  1.00th=[ 1485],  5.00th=[12147], 10.00th=[12550], 20.00th=[12818],
     | 30.00th=[13087], 40.00th=[13355], 50.00th=[13489], 60.00th=[13758],
     | 70.00th=[14160], 80.00th=[14832], 90.00th=[15100], 95.00th=[15368],
     | 99.00th=[16308], 99.50th=[16576], 99.90th=[16845], 99.95th=[16845],
     | 99.99th=[16979]
   bw (  KiB/s): min= 1240, max= 3816, per=99.52%, avg=2361.18, stdev= 8.19, samples=18305
   iops        : min=  310, max=  954, avg=590.29, stdev= 2.05, samples=18305
  lat (usec)   : 20=0.01%, 50=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.02%, 50=0.05%, 100=0.08%
  lat (msec)   : 250=0.19%, 500=0.22%, 750=0.14%, 1000=0.11%, 2000=0.34%
  lat (msec)   : >=2000=98.84%
  cpu          : usr=0.06%, sys=0.35%, ctx=178222, majf=0, minf=9459
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.3%, 32=0.6%, >=64=98.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=177959,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=2372KiB/s (2429kB/s), 2372KiB/s-2372KiB/s (2429kB/s-2429kB/s), io=695MiB (729MB), run=300043-300043msec